renesas/iot-reference-rx/Projects/test_aws_da16600_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_wifi_da16xxx/src/r_wifi_da16xxx_private.h
/*
* Copyright (c) 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/**********************************************************************************************************************
 * File Name    : r_wifi_da16xxx_private.h
 * Description  : Private functions definition for DA16XXX.
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdarg.h>
#include <stdlib.h>

#include "r_wifi_da16xxx_if.h"
#include "r_wifi_da16xxx_os_wrap.h"
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
#include "r_sci_rx_if.h"
#include "r_sci_rx_pinset.h"
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#include "r_sci_rl_if.h"
#endif
#include "r_byteq_if.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
#ifndef R_WIFI_DA16XXX_PRIVATE_H
#define R_WIFI_DA16XXX_PRIVATE_H

#if !defined(WIFI_CFG_SCI_CHANNEL)
#error "Error! Need to define WIFI_CFG_SCI_CHANNEL in r_wifi_da16xxx_config.h"
#endif

#if SCI_CFG_TEI_INCLUDED != 1
#error "Error! Need to set SCI_CFG_TEI_INCLUDED is '1' in r_sci_rx_config.h"
#endif

/* Configuration */
#define TEMP_BUF_MAX                   (256)                                   // RX temp buffer
#define ATCMD_RESP_TIMEOUT             (1000)   // Timeout threshold for AT command response (msec)
#define DA16XXX_AT_SOCK_TX_MAX         (4096)   // DA16XXX socket transmit max length
#define DA16XXX_AT_TLS_CON_TIMEOUT     (60000)  // DA16XXX tls connection timeout
#define DA16XXX_AT_CMD_BUF_MAX         (WIFI_CFG_AT_CMD_TX_BUFFER_SIZE)
#define DA16XXX_AT_RESP_BUF_MAX        (WIFI_CFG_AT_CMD_RX_BUFFER_SIZE)

/* Minimum string size for getting local time string */
#define DA16XXX_LOCAL_TIME_STR_SIZE             (25)
#define DA16XXX_HOURS_IN_SECONDS                (3600)

/* Prefix for OTA service */
#define WIFI_OTA_TYPE_FW                   "mcu_fw"

#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
#define WIFI_RESET_DR_PREPROC(x, y)     ((PORT ## x .PODR.BIT.B ## y))
#define WIFI_RESET_DDR_PREPROC(x, y)    ((PORT ## x .PDR.BIT.B ## y))

#define WIFI_RTS_PDR_PREPROC(x, y)      ((PORT ## x .PDR.BIT.B ## y))
#define WIFI_RTS_PODR_PREPROC(x, y)     ((PORT ## x .PODR.BIT.B ## y))
#define WIFI_CTS_PIDR_PREPROC(x, y)     ((PORT ## x .PIDR.BIT.B ## y))
#define WIFI_SET_PMR_PREPROC(x, y)      ((PORT ## x .PMR.BIT.B ## y))
#define WIFI_SET_PFS_PREPROC(x, y)      ((MPC.P ## x ## y ##PFS.BYTE))

#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#define WIFI_RESET_DR_PREPROC(x, y)     ( P ## x ## _bit.no ## y )
#define WIFI_RESET_DDR_PREPROC(x, y)

#define WIFI_RTS_PDR_PREPROC(x, y)
#define WIFI_RTS_PODR_PREPROC(x, y)
#define WIFI_CTS_PIDR_PREPROC(x, y)
#define WIFI_SET_PMR_PREPROC(x, y)
#define WIFI_SET_PFS_PREPROC(x, y)
#endif

/* Reset port pin macros.  */
#define WIFI_RESET_DR(x, y)             (WIFI_RESET_DR_PREPROC(x, y))
#define WIFI_RESET_DDR(x, y)            (WIFI_RESET_DDR_PREPROC(x, y))

/* RTS port pin macros.  */
#define WIFI_RTS_PDR(x, y)              (WIFI_RTS_PDR_PREPROC(x, y))
#define WIFI_RTS_PODR(x, y)             (WIFI_RTS_PODR_PREPROC(x, y))

/* CTS port pin macros. */
#define WIFI_CTS_PIDR(x, y)             (WIFI_CTS_PIDR_PREPROC(x, y))

/* PMR port macros. */
#define WIFI_SET_PMR(x, y)              (WIFI_SET_PMR_PREPROC(x, y))

/* PFS port macros. */
#define WIFI_SET_PFS(x, y)              (WIFI_SET_PFS_PREPROC(x, y))

/* Debug mode */
#if WIFI_CFG_LOGGING_OPTION == 0

#define WIFI_LOG_ERROR(message)
#define WIFI_LOG_WARN(message)
#define WIFI_LOG_INFO(message)
#define WIFI_LOG_DEBUG(message)

#elif WIFI_CFG_LOGGING_OPTION == 1

#if BSP_CFG_RTOS_USED != 1
#error "Error - BSP_CFG_RTOS_USED is not 1(FreeRTOS)!"
#endif /* BSP_CFG_RTOS_USED */

#define WIFI_LOG_ERROR(message) LogError(message)
#define WIFI_LOG_WARN(message)  LogWarn(message)
#define WIFI_LOG_INFO(message)  LogInfo(message)
#define WIFI_LOG_DEBUG(message) LogDebug(message)

#elif WIFI_CFG_LOGGING_OPTION == 2 || WIFI_CFG_LOGGING_OPTION == 3

/*
 * When WIFI_CFG_DEBUG_LOG is #LOG_NONE, logging is disabled and no
 * logging messages are printed.
 */
#define LOG_NONE            0
#define LOG_ERROR           1
#define LOG_WARN            2
#define LOG_INFO            3
#define LOG_DEBUG           4

#if WIFI_CFG_DEBUG_LOG == LOG_DEBUG
/* All log level messages will logged. */
#define WIFI_LOG_ERROR( message )          printf_log_error message
#define WIFI_LOG_WARN( message )           printf_log_warn message
#define WIFI_LOG_INFO( message )           printf_log_info message
#define WIFI_LOG_DEBUG( message )          printf_log_debug message

#elif WIFI_CFG_DEBUG_LOG == LOG_INFO
/* Only INFO, WARNING and ERROR messages will be logged. */
#define WIFI_LOG_ERROR( message )          printf_log_error message
#define WIFI_LOG_WARN( message )           printf_log_warn message
#define WIFI_LOG_INFO( message )           printf_log_info message
#define WIFI_LOG_DEBUG( message )

#elif WIFI_CFG_DEBUG_LOG == LOG_WARN
/* Only WARNING and ERROR messages will be logged.*/
#define WIFI_LOG_ERROR( message )          printf_log_error message
#define WIFI_LOG_WARN( message )           printf_log_warn message
#define WIFI_LOG_INFO( message )
#define WIFI_LOG_DEBUG( message )

#elif WIFI_CFG_DEBUG_LOG == LOG_ERROR
/* Only ERROR messages will be logged. */
#define WIFI_LOG_ERROR( message )          printf_log_error message
#define WIFI_LOG_WARN( message )
#define WIFI_LOG_INFO( message )
#define WIFI_LOG_DEBUG( message )

#elif WIFI_CFG_DEBUG_LOG == LOG_NONE
#define WIFI_LOG_ERROR( message )
#define WIFI_LOG_WARN( message )
#define WIFI_LOG_INFO( message )
#define WIFI_LOG_DEBUG( message )
#endif /* WIFI_CFG_DEBUG_LOG */

#define WIFI_LOGGING_MAX_MESSAGE_LENGTH 256

#else
#error "Error! Invalid value for WIFI_CFG_LOGGING_OPTION. Please verify this macro in r_wifi_da16xxx_config.h"
#endif /* WIFI_CFG_LOGGING_OPTION */

/* Convert a macro value to a string */
#define WIFI_STRING_MACRO(str)          #str
/* Call WIFI_STRING_MACRO */
#define WIFI_STRING_CONVERT(arg)        (WIFI_STRING_MACRO(arg))

#define DA16XXX_MAX_CERT_SIZE               (2048) // Maximum length of certificate supported by DA16XXX.
#define DA16XXX_MAX_ALPN                    (3)    // Maximum number of ALPNs supported by DA16XXX.
#define DA16XXX_MAX_SNI_LEN                 (64)   // Maximum length of SNI supported by DA16XXX.
#define DA16XXX_CERT_START                  "\x1B"
#define DA16XXX_CERT_END                    "\x03"

#define DA16XXX_MQTT_TLS_CIPHER_SUITE_MAX   (17)   // Maximum number of TLS cipher suites supported by DA16XXX.
#define DA16XXX_MQTT_MAX_TOPIC_LEN          (64)   // Maximum total length for topics supported by DA16XXX.
#define DA16XXX_MQTT_MAX_PUBMSG_LEN         (2048) // Maximum total length for message supported by DA16XXX.
#define DA16XXX_MQTT_MAX_PUBTOPICMSG_LEN    (2113) // Maximum total length for message + topic supported by DA16XXX.
#define DA16XXX_MQTT_SUBTOPIC_MAX_CNT       (4)    // Maximum number of subscription topics allowed.

/**********************************************************************************************************************
 Global Typedef definitions
 *********************************************************************************************************************/
/* Common Timer */
typedef struct
{
    OS_TICK   threshold;        /* Timeout threshold */
    OS_TICK   tick_sta;         /* Tick of Timer start  */
} st_wifi_timer;

/* MQTT module status */
typedef enum
{
    DA16XXX_MQTT_CLOSE = 0,           /* Close MQTT Client service */
    DA16XXX_MQTT_OPEN,                /* Open MQTT Client service  */
    DA16XXX_MQTT_CONNECTED,           /* Connected MQTT broker     */
    DA16XXX_MQTT_DISCONNECTED,        /* Disconnected MQTT broker  */
} e_mqtt_module_status_t;

/* WIFI FIT module status */
typedef enum
{
    MODULE_DISCONNECTED = 0,    /* Disconnected WIFI module */
    MODULE_CONNECTED,           /* Connected WIFI module    */
    MODULE_ACCESSPOINT,         /* Connected access point   */
} e_wifi_module_status_t;

